README.md
- [Emacs.d](#orgba0d9c8)
  - [Installation](#org97208ae)
  - [Usage](#orgc0aa983)
  - [License](#orgf7fd030)


<a id="orgba0d9c8"></a>

# Emacs.d

This is my emacs config forks from purcell&rsquo;s [config](http://github.com/purcell/emacs.d).


<a id="org97208ae"></a>

## Installation

To download this repository as your new emacs.d:

```sh
$ git clone https://github.com/iorest/emacs.d.git ~/.emacs.d
```

That&rsquo;s it!


<a id="orgc0aa983"></a>

## Usage

A full feature list is pending. A quick overview:

-   ample theme and teleline-mode styled for a fashionable look.
-   Use-package macro to isolate package configurations.
-   Magit, the premier git frontend.
-   Smart autocomplete with company-mode.
-   Flycheck.
-   Yasnippet.
-   Language Server Protocol(Optional).
-   Language:
    -   Org
    -   C/C++
    -   Python
    -   HTML/CSS/JavaScript
    -   LaTeX
    -   Emacs Lisp
    -   Go
    -   Rust
    -   Bash
    -   Elixir
    -   Verilog
    -   Dot/plantuml/ditaa/gnuplot
-   Other useful tools.
    -   embrace like surround.vim and more comfortable
    -   hydra keybinding
    -   awesome functions
    -   elfeed
    -   atomic-chrome
    -   emms
    -   tramp
    -   unicad
    -   &#x2026;


<a id="orgf7fd030"></a>

## License

Copyright 2018 Iorest

This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.

This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
